{
  "practice-your": "Practice your",
  "practice-des": "reading, writing, listening and speaking skills at your level.",
  "hero-des": "Here you can find practice materials and activities to improve your English speaking, listening, reading and writing skills. Improving your skills will help you use English.",
  "hero-btn": "Let’s Start",

  "ca-student": "Students",
  "ca-lesson": "Lessons",
  "ca-exercise": "Exercises",
  "ca-videos": "Videos",

  "des-title": "Enhance Your",
  "des-titleone": "English Skills",
  "des-sub": "with Engaging Learning",
  "des-subtwo": "Learn English through a personalized and immersive experience.",

  "ca-listening": "Listening",
  "ca-des-lis": "Improve your listening skills with real-life conversations, podcasts, and interactive exercises.",
  "ca-quiz": "Quiz",
  "ca-des-quiz": "Test your knowledge with fun quizzes with multiple-choice, true/false, and fill-in-the-blank questions.",
  "ca-exercises": "Exercises",
  "ca-des-exercises": "Strengthen your grammar, vocabulary, and sentence structure with interactive exercises.",
  "ca-reading": "Reading",
  "ca-des-reading": "Expand your vocabulary and comprehension with stories, and articles designed to improve fluency.",
  "ca-speaking": "Speaking",
  "ca-des-speaking": "Enhance your speaking skills with pronunciation exercises and real-world conversations.",
  "ca-vocabulary": "Vocabulary",
  "ca-des-vocabulary": "Learn new words and phrases every day by improve your vocabulary with image and sound.",

  "title-card": "Improve Your",
  "title-cardii": "Skills together",
  "des-title-card": "Start Your journey right away",

  "title-cards-skill": "Skills",
  "des-card-skill": "Practise your listening, reading, writing and speaking to use at work or with friends.",
  "sub-des-skill1": "Audio and video to practise your listening and speaking skills.",
  "sub-des-skill2": "Model texts for all types of writing tasks.",
  "sub-des-skill3": "Work on your reading skills to read more quickly and understand more.",

  "title-cards-grammar": "Grammar",
  "des-card-grammar": "Revise and practise your grammar to improve your language level and your confidence.",
  "sub-des-grammar1": "Clear and simple grammar explanations to help you practise different grammar points.",
  "sub-des-grammar2": "Online exercises to help you check your understanding of the grammar points.",
  "sub-des-grammar3": "Use the grammar reference for further practice and more detailed explanations.",

  "title-cards-vocab": "Vocabulary",
  "des-card-vocab": "Learn new words and improve your language level to be able to communicate in English effectively.",
  "sub-des-vocab1": "Online exercises to help you learn the meaning, pronunciation and spelling of new words.",
  "sub-des-vocab2": "Learn new words connected to a wide range of different topics by image and sound.",
  "sub-des-vocab3": "Play our word games and have fun as you improve your vocabulary.",

  "title-section-content": "Join with  ",
  "title-section-content-one": "FluentFlow",
  "title-section-content-two": "your english learning platform today!",
  "des-section-content": "Start learning by registering for free",
  "btn-sign": "Sign up for free",

  "feedback": "Students",
  "students": "Feedback",
  "feedback-des-one": "I enjoyed the lesson! The content is easy to follow, and I feel my speaking skills improving. The course lets me practice at my own pace, and live group classes are engaging. ",
  "feedback-des-two": "This course is truly amazing. The materials are clear and well-organized, and the teacher always provides helpful feedback. I have noticed real improvement in my English skills.",
  "feedback-des-three": "I always struggled with speaking English, but after taking the video lessons, I can see the difference. I highly recommend this platform to anyone who wants to improve their English speaking skills!",
  "feedback-des-four": "The platform makes learning English fun and engaging. The explanations are clear, and I feel more confident in my reading skills!",
  "feedback-des-five": "The AI-powered feedback is super helpful. It points out my mistakes and helps me improve quickly.",
  "feedback-des-six": "The exercises and quizzes keep me engaged and help reinforce what I've learned. I love how the quizzes give instant feedback!",
  "feedback-des-seven": "The vocabulary list is rich. I can learn new words at my own pace and see them in real-world context through images and infographics.",
  "student": "student",

  "start Learning": "Start Learning"
}
