{
  "title": "Start Reading",
  "des": "We will provide you with good studies, reading material, and other exercises for you",
  "start": "Start Learning",
  "readingHere": "Here with us",
  "fluentflow": "with FluentFlow",
  "moreKnow": "To practice you English",
  "description": "Here you can find activities to practise your reading skills. Reading will help you to improve your understanding of the languageand build your vocabulary.The self-study lessons in this section are written and organised by English level based on the Common European Framework of Reference for languages (CEFR). There are different types of texts and interactive exercises that practise the reading skills you need to do well in your studies, to get ahead at work and to communicate in English in your free time.Take our free online class to find out which level to choose. Select your level, from A1 English level (elementary) to C1 English level (advanced), and improve your reading skills at your own speed, whenever it's convenient for you.",
  "a1reading": "A1 Reading",
  "a1writing": "A1 Writing",
  "a2writing": "A2 Writing",
  "b1writing": "B1 Writing",
  "b2writing": "B2 Writing",
  "c1writing": "C1 Writing",
  "writingdescription": "Are you a learner at A1 English level (elementary)? This section offers writing practice to help you write short, simple texts about known topics and fill in forms. Texts include messages, emails and forms.Each lesson has a preparation task, a model text with writing tips and three tasks to check your understanding and to practise a variety of writing skills. Make a start today.",
  "writinga2description": "Are you a learner at A2 English level (pre-intermediate)? This section offers writing practice to help you write short, simple texts, notes and messages. Texts include messages, forum posts, personal profiles, forms and emails.Each lesson has a preparation task, a model text with writing tips and three tasks to check your understanding and to practise a variety of writing skills. Make a start today.",
  "writingb1description": "Are you a learner at B1 English level (intermediate)? This section offers writing practice to help you write simple connected text on familiar topics that are of personal interest. Texts include forum posts, reviews, messages, short essays and emails.   Each lesson has a preparation task, a model text with writing tips and three tasks to check your understanding and to practise a variety of writing skills. Make a start today.",
  "writingb2description": "Are you a learner at B2 English level (upper intermediate)? This section offers writing practice to help you write clear, detailed text on a wide range of topics related to your interests. Texts include essays, reports, reviews, messages and emails.Each lesson has a preparation task, a model text with writing tips and three tasks to check your understanding and to practise a variety of writing skills. Make a start today.",
  "writingc1description": "Are you a learner at C1 English level (advanced)? This section offers writing practice to help you write clear, well-structured texts about complex subjects. Texts include essays, proposals, articles, reports, reviews and emails.Each lesson has a preparation task, a model text with writing tips and three tasks to check your understanding and to practise a variety of writing skills. Make a start today.",
  "a1description": "re you a learner at A1 English level (elementary)? This section offers reading practice to help you understand simple information, words and sentences about known topics. Texts include posters, messages, forms and timetables.Each lesson has a preparation task, a reading text and two tasks to check your understanding and to practise a variety of reading skills. Make a start today."
}
