{
  "login": "ចូលគណនី",
  "email": "អុីម៊ែល",
  "password": "ពាក្យសម្ងាត់",
  "enter your email": "បញ្ចូលអុីម៊ែលរបស់អ្នក",
  "enter your password": "បញ្ចូលពាក្យសម្ងាត់របស់អ្នក",
  "enter your username": "បញ្ចូលឈ្មោះរបស់អ្នក",
  "enter your confirm password": "បញ្ជាក់ពាក្យសម្ងាត់",
  "forgot password": "ភ្លេចពាក្យសម្ងាត់",
  "or": "ឬ",
  "sign in with google": "ចូលជាមួយ google",
  "don't have an account?": "មិនមានគណនីមែនទេ?",
  "username is required": "ឈ្មោះអ្នកប្រើត្រូវបានទាមទារ",
  "invalid email format": "ទម្រង់អុីម៊ែលមិនត្រឹមត្រូវ",
  "email is required": "អុីម៊ែលត្រូវបានទាមទារ",
  "password is required": "ពាក្យសម្ងាត់ត្រូវបានទាមទារ",
  "confirm Password need to be the same as Password!": "បញ្ជាក់ពាក្យសម្ងាត់ត្រូវតែដូចលេខសម្ងាត់!",
  "Confirm Password is required": "បញ្ជាក់ពាក្យសម្ងាត់ត្រូវបានទាមទារ",
  "password must contain one uppercase letter, one lowercase letter, one special character, a number, and be at least 8 characters long.": "ពាក្យសម្ងាត់ត្រូវតែមានអក្សរធំមួយ អក្សរតូចមួយ តួអក្សរពិសេសមួយ លេខ ហើយត្រូវមានយ៉ាងហោចណាស់ 8 តួអក្សរ។ពាក្យសម្ងាត់ត្រូវតែមានអក្សរធំមួយ អក្សរតូចមួយ តួអក្សរពិសេសមួយ លេខ ហើយត្រូវមានយ៉ាងហោចណាស់ 8 តួអក្សរ",
  "register": "បង្កើតគណនីថ្មី",
  "username": "ឈ្មោះ",
  "confirm password": "បញ្ជាក់ពាក្យសម្ងាត់",
  "I agree to the": "ខ្ញុំបានអាននិងយល់ព្រមលើ",
  "privacy policy": "គោលការណ៍ឯកជនភាព",
  "already have an account?": "មានគណនីរួចហើយ?",
  "sign up": "បង្កើតគណនី",
  "signing up...": "កំពុងបង្កើតគណនី...",
  "sign up Successfully!": "ចុះឈ្មោះបានដោយជោគជ័យ!",
  "sign up failed. Please try again.": "ការចុះឈ្មោះបរាជ័យ! សូមព្យាយាមម្តងទៀត។",
  "Privacy Policy": "គោលការណ៍ឯកជនភាព",
  "main-description": "ភាពឯកជនរបស់អ្នកមានសារៈសំខាន់ចំពោះយើង។ គោលការណ៍ឯកជនភាពនេះពន្យល់អំពីវិធីដែលយើងប្រមូល ប្រើប្រាស់ និងការពារព័ត៌មានផ្ទាល់ខ្លួនរបស់អ្នកនៅពេលអ្នកប្រើប្រាស់វេទិកាសិក្សារបស់យើង។",
  "main-description-1": "1. ព័ត៌មានដែលយើងប្រមូល",
  "description-1": "យើងប្រមូលព័ត៌មានដែលអ្នកផ្តល់ដោយផ្ទាល់ដល់យើង ដូចជាឈ្មោះ អាសយដ្ឋានអ៊ីមែល និងពាក្យសម្ងាត់នៅពេលអ្នកបង្កើតគណនី។ យើងក៏ប្រមូលទិន្នន័យអំពីការប្រើប្រាស់វេទិកា រួមមានវគ្គសិក្សាដែលអ្នកចុះឈ្មោះ​​ និង ភាពរីកចំរើន។",
  "main-description-2": "2. វិធីដែលយើងប្រើប្រាស់ព័ត៌មានរបស់អ្នក",
  "description-2": "យើងប្រើព័ត៌មានរបស់អ្នកដើម្បីផ្តល់រក្សា និងធ្វើឱ្យសេវាកម្មរបស់យើងប្រសើរឡើង ប្តូរតាមបំណងបទពិសោធន៍សិក្សារបស់អ្នក និងទាក់ទងជាមួយអ្នកអំពីបច្ចុប្បន្នភាព កម្មវិធីលើកស្ទួយ និងការគាំទ្រ។",
  "main-description-3": "3. សុវត្ថិភាពទិន្នន័យ",
  "description-3": "យើងអនុវត្តវិធានការសុវត្ថិភាពស្តង់ដារអ្នកឧស្សាហកម្ម ដើម្បីការពារទិន្នន័យរបស់អ្នកពីការចូលប្រើប្រាស់ដោយមិនមានការអនុញ្ញាត ការកែប្រែ ឬការបង្ហាញ។ ទោះបីជាយ៉ាងណា វិធីផ្ទេរទិន្នន័យតាមអ៊ីនធឺណិតមិនអាចធានាសុវត្ថិភាព 100% បានទេ។",
  "main-description-4": "4. ការចែករំលែកព័ត៌មានរបស់អ្នក",
  "description-4": "យើងមិនលក់ ឬចែករំលែកព័ត៌មានផ្ទាល់ខ្លួនរបស់អ្នកជាមួយភាគីទីបីឡើយ លើកលែងតែបញ្ជាក់ដោយច្បាប់ ឬដើម្បីផ្តល់សេវាកម្មរបស់យើង។",
  "main-description-5": "5. សិទ្ធិរបស់អ្នក",
  "description-5": "អ្នកមានសិទ្ធិចូលប្រើ ទិដ្ឋភាព ឬលុបព័ត៌មានផ្ទាល់ខ្លួនរបស់អ្នកនៅពេលណាក៏ដោយ។ អ្នកក៏អាចបោះបង់ការទទួលអ៊ីមែលលើកស្ទួយផងដែរ។",
  "main-description-6": "6. ការផ្លាស់ប្តូរគោលការណ៍នេះ",
  "description-6": "យើងអាចធ្វើបច្ចុប្បន្នភាពគោលការណ៍ឯកជនភាពនេះម្តងម្កាល។ យើងនឹងជូនដំណឹងអ្នកអំពីការផ្លាស់ប្តូរដោយការបង្ហាញគោលការណ៍ថ្មីលើទំព័រនេះ។",
  "description-7": "ដោយប្រើប្រាស់វេទិការបស់យើង អ្នកយល់ព្រមអោយប្រមូល និងប្រើប្រាស់ព័ត៌មានអាស្រ័យលើគោលការណ៍នេះ។",
  "Accept": "បានឃើញនិងយល់ព្រម",
  "You must accept the privacy policy": "អ្នកត្រូវតែយល់ព្រមនូវគោលការណ៍ឯកជនភាព",

  "Google login failed. Please try again.": "ការចូលប្រើជាមួយ Google មិនបានសម្រេច។ សូមព្យាយាមម្ដងទៀត។",
  "Processing your login... Please wait!": "កំពុងដំណើរការចូលគណនីរបស់អ្នក... សូមរង់ចាំ!",
  "Please verify your email first!": "សូមផ្ទៀងផ្ទាត់អ៊ីមែលរបស់អ្នកជាមុន!",
  "Registration successful! Redirecting to OTP verification...": "ការចុះឈ្មោះបានជោគជ័យ! កំពុងបញ្ជូនទៅការផ្ទៀងផ្ទាត់ OTP...",
  "Sign up failed. Please try again.": "ការចុះឈ្មោះមិនបានសម្រេច។ សូមព្យាយាមម្ដងទៀត។",
  "Failed to fetch Google user data.": "មិនអាចទាញយកទិន្នន័យរបស់អ្នកពី Google បាន។",

  "Reset Password": "ផ្លាស់ប្តូរលេខសម្ងាត់",
  "New Password": "ពាក្យសម្ងាត់ថ្មី",
  "Enter your new password": "បញ្ចូលពាក្យសម្ងាត់ថ្មីរបស់អ្នក",
  "Resetting...": "កំពុងផ្លាស់ប្តូរឡើងវិញ...",
  "Password reset successfully!": "ការផ្លាស់ប្តូរពាក្យសម្ងាត់ឡើងវិញជោគជ័យ!",
  "Failed to reset password. Please try again.": "ការផ្លាស់ប្តូរពាក្យសម្ងាត់ឡើងវិញបានបរាជ័យ។ សូមព្យាយាមម្ដងទៀត។",

  "Processing...":"កំពុងដំណើរការ..."
}
